Repository: Franvy/Tabnook
Catalog: Tabnook/Localizable.xcstrings
Source language: en
Languages: de, zh_hans

source: %@ current icon
de: %@ aktuelles Symbol
zh_hans: %@ 当前图标

source: %@ failed: %@
de: %@ fehlgeschlagen: %@
zh_hans: %@ 失败：%@

source: Access Required
de: Zugriff erforderlich
zh_hans: 需要访问权限

source: Action Didn't Complete
de: Aktion konnte nicht abgeschlossen werden
zh_hans: 操作未完成

source: Add sites to Favorites in Safari and their icons will appear here.
de: Füge Websites zu den Safari-Favoriten hinzu, damit ihre Symbole hier erscheinen.
zh_hans: 将网站添加到 Safari 收藏夹后，它们的图标会显示在这里。

source: Advanced Info
de: Erweiterte Informationen
zh_hans: 高级信息

source: Appearance
de: Darstellung
zh_hans: 外观

source: Authorize
de: Autorisieren
zh_hans: 授权

source: Authorize Access to Safari Data
de: Zugriff auf Safari-Daten autorisieren
zh_hans: 授权访问 Safari 数据

source: Background Opacity
de: Hintergrundtransparenz
zh_hans: 背景不透明度

# background_opacity_description
source: %1$@ shows the fully transparent Liquid Glass effect over your desktop. %2$@ fills the window with a solid background.
de: %1$@ zeigt den vollständig transparenten Liquid-Glass-Effekt über deinem Schreibtisch. %2$@ füllt das Fenster mit einem einfarbigen Hintergrund.
zh_hans: %1$@ 显示桌面上的完全透明 Liquid Glass 效果。%2$@ 使用纯色背景填充窗口。

source: Backup Folder
de: Sicherungsordner
zh_hans: 备份文件夹

source: Backup folder changed
de: Sicherungsordner geändert
zh_hans: 备份文件夹已更改

source: Backup was written by a newer Tabnook (schema v%lld); restore paused to avoid data loss.
de: Die Sicherung wurde von einer neueren Tabnook-Version erstellt (Schema v%lld); Wiederherstellung zum Schutz vor Datenverlust pausiert.
zh_hans: 备份由更新版本的 Tabnook 创建（架构 v%lld）；已暂停恢复以避免数据丢失。

source: Backup was written by a newer Tabnook; restore paused to prevent data loss.
de: Die Sicherung wurde von einer neueren Tabnook-Version erstellt; Wiederherstellung zum Schutz vor Datenverlust pausiert.
zh_hans: 备份由更新版本的 Tabnook 创建；已暂停恢复以避免数据丢失。

source: Backup write failed: %@. Your icon is applied but unprotected.
de: Sicherung konnte nicht geschrieben werden: %@. Dein Symbol wurde angewendet, ist aber nicht geschützt.
zh_hans: 备份写入失败：%@。你的图标已应用，但未受到保护。

source: Bookmarks.plist had an unexpected structure.
de: Bookmarks.plist hatte eine unerwartete Struktur.
zh_hans: 备份写入失败：%@。你的图标已应用，但未受到保护。

source: Bookmarks.plist parse failed or structure was unexpected.
de: Bookmarks.plist konnte nicht verarbeitet werden oder hatte eine unerwartete Struktur.
zh_hans: 无法解析 Bookmarks.plist，或其结构与预期不符。

source: Check for Updates…
de: Nach Updates suchen…
zh_hans: 检查更新…

source: Checksum
de: Prüfsumme
zh_hans: 校验和

source: Choose
de: Auswählen
zh_hans: 选择

source: Choose Backup Folder
de: Sicherungsordner auswählen
zh_hans: 选择备份文件夹

source: Choose File
de: Datei auswählen
zh_hans: 选择文件

source: Choose File…
de: Datei auswählen…
zh_hans: 选择文件…

source: Choose Folder…
de: Ordner auswählen…
zh_hans: 选择文件夹…

source: Close
de: Schließen
zh_hans: 关闭

source: Could not find this favorite inside Bookmarks.plist.
de: Dieser Favorit konnte in Bookmarks.plist nicht gefunden werden.
zh_hans: 无法在 Bookmarks.plist 中找到此收藏夹。

source: Custom icons are mirrored here and auto-restored when Safari refreshes its cache. Point this at iCloud Drive / Dropbox to sync across Macs.
de: Benutzerdefinierte Symbole werden hier gespiegelt und automatisch wiederhergestellt, wenn Safari seinen Cache aktualisiert. Verwende iCloud Drive / Dropbox, um zwischen Macs zu synchronisieren.
zh_hans: 自定义图标会同步到此处，并在 Safari 刷新缓存时自动恢复. 可将此位置设置为 iCloud Drive / Dropbox 以在多台 Mac 间同步。

source: Database query failed: %@
de: Datenbankabfrage fehlgeschlagen: %@
zh_hans: 数据库查询失败：%@

source: DB Code
de: Datenbankcode
zh_hans: 数据库代码

source: Distinct codes:
de: Unterschiedliche Codes:
zh_hans: 不同代码：

source: Done
de: Fertig
zh_hans: 完成

source: Double click to edit this site's icon
de: Doppelklicken, um das Symbol dieser Website zu bearbeiten
zh_hans: 双击编辑此网站的图标

source: Double-click to rename
de: Doppelklicken zum Umbenennen
zh_hans: 双击重命名

source: Downloaded icon is not a valid image.
de: Heruntergeladenes Symbol ist kein gültiges Bild.
zh_hans: 下载的图标不是有效图像。

source: Drop a PNG, JPEG, or TIFF here
de: PNG, JPEG oder TIFF hier ablegen
zh_hans: 将 PNG、JPEG 或 TIFF 拖放到这里

source: Drop an image to replace the current icon, or click to choose a file
de: Lege ein Bild ab, um das aktuelle Symbol zu ersetzen, oder klicke, um eine Datei auszuwählen
zh_hans: 拖放图片以替换当前图标，或点击选择文件

source: Edit Icon
de: Symbol bearbeiten
zh_hans: 编辑图标

source: Found unknown-code records:
de: Datensätze mit unbekannten Codes gefunden:
zh_hans: 发现未知代码记录：

source: Glass · Large
de: Glas · Groß
zh_hans: 玻璃 · 大型

source: Glass · Small
de: Glas · Klein
zh_hans: 玻璃 · 小型

source: Grant Access…
de: Zugriff erlauben…
zh_hans: 授予访问权限…

source: Icon drop zone
de: Symbol-Ablagebereich
zh_hans: 图标拖放区域

source: Icon Style
de: Symbolstil
zh_hans: 图标样式

source: Icon Style Code Diagnostics
de: Diagnose der Symbolstil-Codes
zh_hans: 图标样式代码诊断

source: Icons
de: Symbole
zh_hans: 图标

source: Inspect Style Codes for Current List
de: Stilcodes der aktuellen Liste prüfen
zh_hans: 检查当前列表的样式代码

source: Interpreted As
de: Interpretiert als
zh_hans: 解释为

source: Lock icons folder
de: Symbolordner sperren
zh_hans: 锁定图标文件夹

source: Lock Icons Folder
de: Symbolordner sperren
zh_hans: 锁定图标文件夹

source: no cache_settings row
de: kein cache_settings-Eintrag
zh_hans: 没有 cache_settings 记录

source: No Favorites
de: Keine Favoriten
zh_hans: 没有收藏夹

source: No online icons found.
de: Keine Online-Symbole gefunden.
zh_hans: 未找到在线图标。

source: No unknown codes found in the current database.
de: Keine unbekannten Codes in der aktuellen Datenbank gefunden.
zh_hans: 当前数据库中未发现未知代码。

source: Open in Safari
de: In Safari öffnen
zh_hans: 在 Safari 中打开

source: or click to choose a file
de: oder klicken, um eine Datei auszuwählen
zh_hans: 或点击选择文件

source: Paste
de: Einfügen
zh_hans: 粘贴

source: Paste from Clipboard
de: Aus Zwischenablage einfügen
zh_hans: 从剪贴板粘贴

source: Paste Image (⌘V)
de: Bild einfügen (⌘V)
zh_hans: 粘贴图像 (⌘V)

source: Pick a folder to store Tabnook's custom icon backups. iCloud Drive is recommended for multi-Mac sync.
de: Wähle einen Ordner zum Speichern der benutzerdefinierten Symbol-Sicherungen von Tabnook. Für die Synchronisierung zwischen mehreren Macs wird iCloud Drive empfohlen.
zh_hans: 选择一个文件夹来存储 Tabnook 的自定义图标备份。建议使用 iCloud Drive 在多台 Mac 之间同步。

source: Re-authorize
de: Zugriff erneut erlauben
zh_hans: 重新授权

source: Re-authorize ~/Library/Safari/
de: Zugriff auf ~/Library/Safari/ erneut erlauben
zh_hans: 重新授权访问 ~/Library/Safari/

source: Read icon style code diagnostics
de: Symbolstil-Code-Diagnose lesen
zh_hans: 读取图标样式代码诊断

source: Reading Safari data…
de: Safari-Daten werden gelesen…
zh_hans: 正在读取 Safari 数据…

source: Remove this site's custom icon and revert to Safari's default
de: Benutzerdefiniertes Symbol dieser Website entfernen und Safari-Standard wiederherstellen
zh_hans: 移除此网站的自定义图标并恢复 Safari 默认图标

source: Rename
de: Umbenennen
zh_hans: 重命名

source: Rename favorite
de: Favorit umbenennen
zh_hans: 重命名收藏夹

source: Rename…
de: Umbenennen…
zh_hans: 重命名…

source: Replace Icon
de: Symbol ersetzen
zh_hans: 替换图标

source: Reset
de: Zurücksetzen
zh_hans: 重置

source: Reset backup folder failed: %@
de: Zurücksetzen des Sicherungsordners fehlgeschlagen: %@
zh_hans: 重置备份文件夹失败：%@

source: Reset default icons
de: Standardsymbole zurücksetzen
zh_hans: 重置默认图标

source: Reset icon
de: Symbol zurücksetzen
zh_hans: 重置图标

source: Reset This Site's Icon
de: Symbol dieser Website zurücksetzen
zh_hans: 重置此网站的图标

source: Reset to Default
de: Auf Standard zurücksetzen
zh_hans: 恢复默认设置

source: Reset to Default Icons
de: Standardsymbole wiederherstellen
zh_hans: 恢复默认图标

source: Restart Safari to apply changes
de: Safari neu starten, um Änderungen anzuwenden
zh_hans: 重新启动 Safari 以应用更改

source: Restart Safari to Apply Changes
de: Safari neu starten, um Änderungen anzuwenden
zh_hans: 重新启动 Safari 以应用更改

source: Restart Safari to apply icon changes (⌘R)
de: Safari neu starten, um Symboländerungen anzuwenden (⌘R)
zh_hans: 重新启动 Safari 以应用图标更改 (⌘R)

source: Restarting Safari
de: Safari wird neu gestartet
zh_hans: 正在重新启动 Safari

source: Restarting Safari to apply the new name
de: Safari wird neu gestartet, um den neuen Namen anzuwenden
zh_hans: 正在重新启动 Safari 以应用新名称

source: Restored %lld custom icons from backup
de: %lld benutzerdefinierte Symbole aus der Sicherung wiederhergestellt
zh_hans: 已从备份恢复 %lld 个自定义图标

source: Reveal Backup Folder in Finder
de: Sicherungsordner im Finder anzeigen
zh_hans: 在 Finder 中显示备份文件夹

source: Reveal in Finder
de: Im Finder anzeigen
zh_hans: 在 Finder 中显示

source: Reverted to default backup folder
de: Zum Standard-Sicherungsordner zurückgekehrt
zh_hans: 已恢复默认备份文件夹

source: Safari favorites list
de: Safari-Favoritenliste
zh_hans: Safari 收藏夹列表

source: Scope: Current visible list
de: Bereich: Aktuell sichtbare Liste
zh_hans: 范围：当前可见列表

source: Search Online
de: Online suchen
zh_hans: 在线搜索

source: Set icon style
de: Symbolstil festlegen
zh_hans: 设置图标样式

source: Show Icon File in Finder
de: Symboldatei im Finder anzeigen
zh_hans: 在 Finder 中显示图标文件

source: Site Not Found
de: Website nicht gefunden
zh_hans: 未找到网站

source: Source:
de: Quelle:
zh_hans: 来源：

source: Suggested Online
de: Online-Vorschläge
zh_hans: 在线建议

source: Tabnook needs to read Bookmarks.plist (your favorites) and Touch Icons Cache (icons) inside ~/Library/Safari/. Select the Safari folder below and click Authorize.
de: Tabnook muss auf Bookmarks.plist (deine Favoriten) und den Touch-Icons-Cache (Symbole) in ~/Library/Safari/ zugreifen. Wähle unten den Safari-Ordner aus und klicke auf „Autorisieren“.
zh_hans: Tabnook 需要读取 ~/Library/Safari/ 中的 Bookmarks.plist（你的收藏夹）和 Touch Icons Cache（图标）。请选择下面的 Safari 文件夹并点击“授权”。

source: Tabnook needs to read the following to manage your favorite icons:
de: Tabnook benötigt Zugriff auf folgende Daten, um deine Favoriten-Symbole zu verwalten:
zh_hans: Tabnook 需要读取以下内容以管理你的收藏夹图标：

source: The current list is empty; nothing to diagnose.
de: Die aktuelle Liste ist leer; es gibt nichts zu diagnostizieren.
zh_hans: 当前列表为空；没有可诊断的内容。

source: This code has no mapping yet. The segmented control shows an editable fallback value; picking any style changes the database value to 0, 1, or 3.
de: Für diesen Code gibt es noch keine Zuordnung. Die Segmentsteuerung zeigt einen bearbeitbaren Ersatzwert; die Auswahl eines Stils ändert den Datenbankwert auf 0, 1 oder 3.
zh_hans: 此代码尚无对应映射。分段控件显示可编辑的备用值；选择任意样式会将数据库值更改为 0、1 或 3。

source: This favorite currently has no matching cache_settings row. The segmented control shows a fallback value; picking any style writes the corresponding code back to the database.
de: Dieser Favorit besitzt derzeit keinen passenden cache_settings-Eintrag. Die Segmentsteuerung zeigt einen Ersatzwert; die Auswahl eines Stils schreibt den entsprechenden Code zurück in die Datenbank.
zh_hans: 此收藏夹当前没有匹配的 cache_settings 记录。分段控件显示备用值；选择任意样式会将对应代码写回数据库。

source: Total items:
de: Gesamtanzahl:
zh_hans: 总项目数：

source: Touch Icons cache
de: Touch-Icon-Cache
zh_hans: Touch Icon 缓存

source: Transparent · Large
de: Transparent · Groß
zh_hans: 透明 · 大型

source: Unable to convert the icon to a Safari-compatible PNG format.
de: Das Symbol konnte nicht in ein Safari-kompatibles PNG-Format konvertiert werden.
zh_hans: 无法将图标转换为 Safari 兼容的 PNG 格式。

source: Unable to open Safari icon cache database: %@
de: Safari-Symbol-Cache-Datenbank konnte nicht geöffnet werden: %@
zh_hans: 无法打开 Safari 图标缓存数据库：%@

source: Unable to read %@ (permission denied). Please authorize access to the ~/Library/Safari/ folder. Underlying error: %@
de: %@ konnte nicht gelesen werden (Zugriff verweigert). Bitte autorisiere den Zugriff auf den Ordner ~/Library/Safari/. Ursprünglicher Fehler: %@
zh_hans: 无法读取 %@（权限被拒绝）。请授权访问 ~/Library/Safari/ 文件夹。底层错误：%@

source: Unable to read backup file at %@.
de: Sicherungsdatei unter %@ konnte nicht gelesen werden.
zh_hans: 无法读取 %@ 处的备份文件。

source: Unable to read favorites
de: Favoriten konnten nicht gelesen werden
zh_hans: 无法读取收藏夹

source: Unable to read Safari database
de: Safari-Datenbank konnte nicht gelesen werden
zh_hans: 无法读取 Safari 数据库

source: Unable to read the icon file. Please use a common image format and try again.
de: Die Symboldatei konnte nicht gelesen werden. Verwende ein gängiges Bildformat und versuche es erneut.
zh_hans: 无法读取图标文件。请使用常见图像格式后重试。

source: Unable to read website icon data.
de: Website-Symboldaten konnten nicht gelesen werden.
zh_hans: 无法读取网站图标数据。

source: Unable to save to Bookmarks.plist: %@
de: Speichern in Bookmarks.plist fehlgeschlagen: %@
zh_hans: 无法保存到 Bookmarks.plist：%@

source: unknown
de: unbekannt
zh_hans: 未知

source: Unlock icons folder
de: Symbolordner entsperren
zh_hans: 解锁图标文件夹

source: Unlock Icons Folder
de: Symbolordner entsperren
zh_hans: 解锁图标文件夹

source: Write and lock icon files
de: Symboldateien schreiben und sperren
zh_hans: 写入并锁定图标文件

source: Write icon
de: Symbol schreiben
zh_hans: 写入图标

source: %@, host %@
zh_hans: %@，主机 %@

source: Name
zh_hans: 名称

source: OK
zh_hans: 确定
